In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

       Olma      Anor     Qovun     Anjir
a  0.409005 -0.156009 -0.946765  1.850497
b  1.108030 -1.552850 -1.165215 -1.368765
c -0.575795  1.389190 -0.906317 -0.421810

In [3]:
np.abs(df)

       Olma      Anor     Qovun     Anjir
a  0.409005  0.156009  0.946765  1.850497
b  1.108030  1.552850  1.165215  1.368765
c  0.575795  1.389190  0.906317  0.421810

In [6]:
np.round(df)

   Olma  Anor  Qovun  Anjir
a   0.0  -0.0   -1.0    2.0
b   1.0  -2.0   -1.0   -1.0
c  -1.0   1.0   -1.0   -0.0

In [7]:
df.mean()

Olma     0.313747
Anor    -0.106556
Qovun   -1.006099
Anjir    0.019974
dtype: float64

In [8]:
df

       Olma      Anor     Qovun     Anjir
a  0.409005 -0.156009 -0.946765  1.850497
b  1.108030 -1.552850 -1.165215 -1.368765
c -0.575795  1.389190 -0.906317 -0.421810

In [9]:
df.apply(np.abs)

       Olma      Anor     Qovun     Anjir
a  0.409005  0.156009  0.946765  1.850497
b  1.108030  1.552850  1.165215  1.368765
c  0.575795  1.389190  0.906317  0.421810

In [15]:
df.apply(np.mean)

Olma     0.313747
Anor    -0.106556
Qovun   -1.006099
Anjir    0.019974
dtype: float64

In [16]:
df.apply(np.sum, axis='columns')

a    1.156729
b   -2.978800
c   -0.514732
dtype: float64

In [17]:
f = lambda x: x.max() - x.min()

In [19]:
df.apply(f)

Olma     1.683825
Anor     2.942041
Qovun    0.258897
Anjir    3.219262
dtype: float64

In [20]:
df

       Olma      Anor     Qovun     Anjir
a  0.409005 -0.156009 -0.946765  1.850497
b  1.108030 -1.552850 -1.165215 -1.368765
c -0.575795  1.389190 -0.906317 -0.421810

In [21]:
def foo(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [23]:
df.apply(foo)

         Olma     Anor     Qovun     Anjir
min -0.575795 -1.55285 -1.165215 -1.368765
max  1.108030  1.38919 -0.906317  1.850497

In [24]:
f = lambda x: x*x

In [29]:
df = pd.DataFrame(np.arange(1,13).reshape(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

   Olma  Anor  Qovun  Anjir
a     1     2      3      4
b     5     6      7      8
c     9    10     11     12

In [30]:
df.applymap(f)

   Olma  Anor  Qovun  Anjir
a     1     4      9     16
b    25    36     49     64
c    81   100    121    144

In [31]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [ ]:
obj